app/controllers/trabajos_controller.rb

SELECT "trabajos".* FROM "trabajos"
---
  def index
    @trabajos = Trabajo.all

INSERT INTO "trabajos" ("puesto", "descripción", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["puesto", ""], ["descripción", ""], ["created_at", "2023-08-12 20:31:10.277360"], ["updated_at", "2023-08-12 20:31:10.277360"]]
---
  def create
    @trabajo = Trabajo.new(trabajo_params)

    respond_to do |format|
      if @trabajo.save

UPDATE "trabajos" SET "puesto" = $1, "descripción" = $2, "updated_at" = $3 WHERE "trabajos"."id" = $4  [["puesto", "trainer"], ["descripción", "aplicado"], ["updated_at", "2023-08-12 21:54:11.810199"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @trabajo.update(trabajo_params)

DELETE FROM "trabajos" WHERE "trabajos"."id" = $1  [["id", 1]]
---
  def destroy
    @trabajo.destroy

SELECT "trabajos".* FROM "trabajos" WHERE "trabajos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_trabajo
      @trabajo =Trabajo.find(params[:id])