app/controllers/usuarios_controller.rb

SELECT "trabajos".* FROM "trabajos"
---
  def new
    @usuario = Usuario.new
    @trabajos = Trabajo.all

INSERT INTO "usuarios" ("nombre", "edad", "direccion", "telefono", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "Isabel"], ["edad", "34"], ["direccion", "4444"], ["telefono", "5446"], ["created_at", "2023-08-12 22:48:17.199516"], ["updated_at", "2023-08-12 22:48:17.199516"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save